# ===== 2 =====


from utils import important_message


def main() -> None:
    """Request message from the user and put it in stdout with function important_message"""
    # msg = input('текст сообщения: ')
    important_message(msg)


'''
>>> text = 'Обратите внимание на очень важное сообщение от команды разработчиков этой великолепной программы'
>>> msg = important_message(text)
>>> print(msg)
#========================================================================================#
#                                                                                        #
#       Обратите внимание на очень важное сообщение от команды разработчиков этой        #
#                                 великолепной программы                                 #
#                                                                                        #
#========================================================================================#

>>>
'''
