# ===== 7 =====


list_of_dicts = [
    {
        'Липецк': 1,
        'Пермь': 9,
        'Ростов-на-Дону': 6,
        'Тула': 3,
        'Ульяновск': 7,
        'Ярославль': 9
    },
    {
        'Барнаул': 5,
        'Краснодар': 9,
        'Красноярск': 9,
        'Махачкала': 5,
        'Новосибирск': 7,
        'Пермь': 3,
        'Ростов-на-Дону': 5,
        'Самара': 2,
        'Санкт-Петербург': 6,
        'Хабаровск': 7
    },
    {
        'Краснодар': 4,
        'Красноярск': 1,
        'Москва': 1,
        'Санкт-Петербург': 4,
        'Тольятти': 9,
        'Тула': 2,
        'Тюмень': 5,
        'Ульяновск': 4
    },
]


out_dict = {}
for key, value in list_of_dicts[0].items():
    out_dict.update({key : {value}})

for i in range(1, len(list_of_dicts)):
    for key, value in list_of_dicts[i].items():
        if key in out_dict.keys():
            out_dict[key].add(value)
        else:
            out_dict.update({key : {value}})
s = ''
for key, value in out_dict.items():
    s += f"'{key}': {value},\n"
print(s[:-2])

'''
'Липецк': {1},
'Пермь': {9, 3},
'Ростов-на-Дону': {5, 6},
'Тула': {2, 3},
'Ульяновск': {4, 7},     
'Ярославль': {9},        
'Барнаул': {5},
'Краснодар': {9, 4},     
'Красноярск': {9, 1},
'Махачкала': {5},
'Новосибирск': {7},
'Самара': {2},
'Санкт-Петербург': {4, 6},
'Хабаровск': {7},
'Москва': {1},
'Тольятти': {9},
'Тюмень': {5}
'''